//=============================================================================
// TRP_ParticlePreset.js
//=============================================================================
/*:
 * @help
 * 【更新履歴】
 * 1.08 2022/09/04 漂う光系グループプリセット32種追加
 * 1.00
 *
 * aura_bp <対象:character> ＠キャラ_play:青白い粒子と集中線拡散
 * aura_bp2 <対象:character> ＠キャラ_play:青白いサークル拡大
 * aura_static_b <対象:character> ＠キャラ:もやもやのオーラ(アニメ画像使用)
 * black_particle_w <対象:weather> ＠天候:黒いパーティクル
 * blizard_w <対象:weather> ＠天候:吹雪
 * bubble_c <対象:---> ＠キャラ:キャラを包む泡。attach推奨
 * bubble_cp <対象:character> ＠キャラ_play:穴から吹き出す泡
 * bubble_w <対象:weather> ＠天候:水中の泡
 * charm_bw <対象:weather> ＠天候:画面全体ハート
 * click <対象:click> ＠click:マウスクリック/タップ用1
 * click2 <対象:click> ＠click:マウスクリック/タップ用2
 * cloud_shadow_w <対象:screen> ＠天候:雲の影
 * cloud_w <対象:screen> ＠天候:雲
 * dark_hole_r <対象:region> ＠リージョン:穴からキラキラ吹き上げる光
 * dark_hole_r_2 <対象:region> ＠リージョン:穴から吹き上げる線形の光
 * dark_hole_r_3 <対象:region> ＠リージョン:穴の中のもやもや
 * darkness_s <対象:screen> ＠スクリーン:暗闇の視界制限
 * diamonddust_w <対象:weather> ＠天候:キラキラ漂うダイヤモンドダスト
 * diamonddust_w2 <対象:weather> ＠天候:キラキラ漂うダイヤモンドダスト2
 * drag <対象:character> ＠drag:マウスドラッグ用
 * dust_walk <対象:walk> ＠歩行:土煙
 * explode_cp_1 <対象:character> ＠キャラ:爆発前のサークル収束
 * explode_cp_2 <対象:character> ＠キャラ:爆発の炎
 * explode_cp_3 <対象:character> ＠キャラ:爆発時のサークル発散
 * explode_cp_4 <対象:character> ＠キャラ:爆発後のチカチカする円
 * fire_c <対象:character> ＠キャラ:大きな炎
 * fireworks_c <対象:character> ＠キャラ:打ち上げ花火
 * fireworks_dragon_c <対象:character> ＠キャラ:噴出タイプの花火
 * fish_w <対象:weather> ＠天候:水中の影
 * flare_s <対象:screen> ＠スクリーン:太陽光のフレア
 * flash_s <対象:screen> ＠スクリーン:太陽光のフラッシュ
 * flower_walk <対象:walk> ＠歩行:歩いた跡に花(タイル使用)
 * fog_shadow_w <対象:screen> ＠天候:モヤの影
 * fog_w <対象:weather> ＠天候:薄いフォグ
 * fog_w2 <対象:screen> ＠天候:濃いめのモヤ
 * fuss_c <対象:character> ＠キャラ:乱闘中っぽいアニメ調の煙
 * fuss_startdash <対象:startdash> ＠スタートダッシュ:アニメ調の煙
 * fuss_walk <対象:walk> ＠歩行:アニメ調の煙
 * grass_walk <対象:walk> ＠歩行:飛び散る草
 * illumination_w <対象:weather> ＠天候:カラフルなイルミネーション
 * kira_blue_c <対象:character> ＠キャラ:青いキラキラエフェクト
 * light_float_cp <対象:character> ＠キャラ_play:光柱が頭上に向かって消える
 * light_floor_r <対象:region> ＠リージョン:キラキラ点滅する小さな光粒
 * light_leak_s <対象:screen> ＠スクリーン:淡いライトリーク
 * light_leak_s2 <対象:screen> ＠スクリーン:青&緑のライトリーク
 * light_pillar_r <対象:region> ＠リージョン:空エリアの光の柱
 * light_pillar_w <対象:weather> ＠天候:上部からの光柱。横スク用マップ用
 * light_r <対象:region> ＠region:テスト用1
 * magic_circle_c <対象:character> ＠キャラ:魔法陣の幾何学エフェクト
 * magma_r <対象:region> ＠リージョン:マグマの床
 * mahoujin_c <対象:character> ＠キャラ:魔法陣上のキラキラ光粒
 * mahoujin_c2 <対象:character> ＠キャラ:魔法陣上の光線演出
 * monster_c <対象:character> ＠キャラ:中央から光球が発生して上に
 * monster_cp <対象:character> ＠キャラ:パーティクルが収束
 * monster_cp2 <対象:character> ＠キャラ:集中線が発散。
 * orb_c <対象:character> ＠キャラ:オーブの波動
 * orb_cp <対象:character> ＠キャラ_play:青白いキラキラ光粒が発散
 * particle <対象:character> ＠テスト用
 * particle_w <対象:weather> ＠天候:ゆらゆら上昇する光粒
 * petal_w <対象:weather> ＠天候:桜の花びら
 * poison_r <対象:region> ＠リージョン:毒の沼
 * rain_fog_w <対象:weather> ＠天候:雨天時のモヤ
 * rain_w <対象:weather> ＠天候:しとしと雨
 * rain_w2 <対象:weather> ＠天候:強めの雨
 * rain_w3 <対象:weather> ＠天候:本降りの雨
 * ripple_r <対象:region> ＠リージョン:水たまりの波紋
 * ripple_walk <対象:walk> ＠歩行:水の波紋
 * smoke_c <対象:character> ＠キャラ:焚き火の煙
 * smoke_c2 <対象:character> ＠キャラ:fire用の大きな煙
 * snow_w <対象:weather> ＠天候:うっすらと降る雪
 * snow_w2 <対象:weather> ＠天候:雪の結晶
 * sparks_c <対象:character> ＠キャラ:焚き火の火の粉
 * sparks_w <対象:weather> ＠天候:薄っすらと舞い上がる火の粉
 * splash_walk <対象:walk> ＠歩行:水しぶき
 * statue_orb_c <対象:character> ＠キャラ:石像のオーブから出る光粒
 * thunder_w <対象:weather> ＠天候:ピカッと一瞬光る稲妻
 * thunder_w2 <対象:weather> ＠天候:黄色の稲妻
 * warp_red_c <対象:character> ＠キャラ:赤魔法陣ワープの集中線
 * warp_red_cp <対象:character> ＠キャラ:ワープ直後の幾何学エフェクト
 *
 * 【パーティクルグループ】
 * commet <対象:weather> ＠星空と彗星
 * firefly <対象:region> ＠蛍
 * fireworks <対象:character> ＠打ち上げ花火
 * light_green_w1 <対象:weather> ＠天候:漂う光<緑/森_1>
 * light_green_w2 <対象:weather> ＠天候:漂う光<緑/森_2>
 * light_green_w3 <対象:weather> ＠天候:漂う光<緑/森_3>
 * light_black_w1 <対象:weather> ＠天候:漂う光<黒/闇_1>
 * light_black_w2 <対象:weather> ＠天候:漂う光<黒/闇_2>
 * light_black_w3 <対象:weather> ＠天候:漂う光<黒/闇_3>
 * light_ash_w1 <対象:weather> ＠天候:漂う光<灰_1>
 * light_ash_w2 <対象:weather> ＠天候:漂う光<灰_2>
 * light_ice_w1 <対象:weather> ＠天候:漂う光<氷_1>
 * light_ice_w2 <対象:weather> ＠天候:漂う光<氷_2>
 * light_ice_w3 <対象:weather> ＠天候:漂う光<氷_3>
 * light_red_w1 <対象:weather> ＠天候:漂う光<赤/炎_1>
 * light_red_w2 <対象:weather> ＠天候:漂う光<赤/炎_2>
 * light_red_w3 <対象:weather> ＠天候:漂う光<赤/炎_3>
 * light_blue_w1 <対象:weather> ＠天候:漂う光<青/水_1>
 * light_blue_w2 <対象:weather> ＠天候:漂う光<青/水_2>
 * light_blue_w3 <対象:weather> ＠天候:漂う光<青/水_3>
 * light_white_w1 <対象:weather> ＠天候:漂う光<白/光_1>
 * light_white_w2 <対象:weather> ＠天候:漂う光<白/光_2>
 * light_white_w3 <対象:weather> ＠天候:漂う光<白/光_3>
 * light_purple_w1 <対象:weather> ＠天候:漂う光<紫/魔_1>
 * light_purple_w2 <対象:weather> ＠天候:漂う光<紫/魔_2>
 * light_purple_w3 <対象:weather> ＠天候:漂う光<紫/魔_3>
 * light_gold_w1 <対象:weather> ＠天候:漂う光<金_1>
 * light_gold_w2 <対象:weather> ＠天候:漂う光<金_2>
 * light_gold_w3 <対象:weather> ＠天候:漂う光<金_3>
 * light_monochrome_w1 <対象:weather> ＠天候:漂う光<白黒/陰陽_1>
 * light_monochrome_w2 <対象:weather> ＠天候:漂う光<白黒/陰陽_2>
 * light_monochrome_w3 <対象:weather> ＠天候:漂う光<白黒/陰陽_3>
 * light_rainbow_w1 <対象:weather> ＠天候:漂う光<虹_1>
 * light_rainbow_w2 <対象:weather> ＠天候:漂う光<虹_2>
 * light_rainbow_w3 <対象:weather> ＠天候:漂う光<虹_3>
 *
 * @requiredAssets img/particles/dust4
 * @requiredAssets img/particles/dust2
 * @requiredAssets img/particles/dust3
 * @requiredAssets img/particles/dust1
 * @requiredAssets img/particles/dust4g
 * @requiredAssets img/particles/dust2g
 * @requiredAssets img/particles/dust1g
 * @requiredAssets img/particles/dust3g
 * @requiredAssets img/particles/particle7
 * @requiredAssets img/particles/particle9
 * @requiredAssets img/particles/particle8
 * @requiredAssets img/particles/particle1
 * @requiredAssets img/particles/leaf1g
 * @requiredAssets img/particles/shine2
 * @requiredAssets img/particles/shine_thin1g
 * @requiredAssets img/particles/shine_thin3
 * @requiredAssets img/particles/flare
 * @requiredAssets img/particles/line_ray2
 * @requiredAssets img/particles/particle5
 * @requiredAssets img/particles/line_oval1
 * @requiredAssets img/particles/shine3
 * @requiredAssets img/particles/line_oval3
 * @requiredAssets img/particles/snow_particle2g
 * @requiredAssets img/particles/circle3g
 * @requiredAssets img/particles/cloud3
 * @requiredAssets img/particles/snow_particle2
 * @requiredAssets img/particles/snow_particle1
 * @requiredAssets img/particles/bubble1
 * @requiredAssets img/particles/heart4g
 * @requiredAssets img/particles/circle
 * @requiredAssets img/particles/cloud2
 * @requiredAssets img/particles/cloud1
 * @requiredAssets img/particles/smoke2
 * @requiredAssets img/particles/cloud2s
 * @requiredAssets img/particles/particle2
 * @requiredAssets img/particles/smog1
 * @requiredAssets img/particles/circle2
 * @requiredAssets img/particles/smog2
 * @requiredAssets img/particles/smoke1
 * @requiredAssets img/particles/flame1g
 * @requiredAssets img/particles/fish1
 * @requiredAssets img/particles/flare2
 * @requiredAssets img/particles/cartoon_fuss2
 * @requiredAssets img/particles/cartoon_fuss1
 * @requiredAssets img/particles/flame1
 * @requiredAssets img/particles/particle4
 * @requiredAssets img/particles/hexagon_line3
 * @requiredAssets img/particles/hexagon1
 * @requiredAssets img/particles/line2
 * @requiredAssets img/particles/line_oval2
 * @requiredAssets img/particles/ripple1g
 * @requiredAssets img/particles/petal1
 * @requiredAssets img/particles/line_rain2
 * @requiredAssets img/particles/line_rain1
 * @requiredAssets img/particles/ripple2
 * @requiredAssets img/particles/snow2
 * @requiredAssets img/particles/snow5g
 * @requiredAssets img/particles/thunder1
 * @requiredAssets img/particles/thunder2
 * @requiredAssets img/particles/square_line1
 */

var $dataTrpParticlePreset, $dataTrpParticleGroupsPreset;


(() => {
	'use strict';

	function LC(text) { return text; }

	$dataTrpParticlePreset = {
		//システム用
		click: [[[0, 1, 0.85, 0.5, 1, 0], 0, 0], [[0, 1.5, 0.5, 1, 1, 0], 0.5, 0, 0], [[0, 200, 1, 200], 0.5, 0, 0], [[0, "#0031ff", 0.25, "#eaff00", 0.5, "#00ff04", 0.75, "#7b00ff", 1, "#ff0000"], 0, 0], 1, [0, 300], 0, [0, 360], [0, 0], 0, 0, [0.4, 0.6], 1, 0.001, 1, 1, 0.01, 1000, [0, 0], 0, [0, 0], null, null, 0, 0, "particle1", 12, "click:マウスクリック/タップ用1"],
		click2: [[[0, 0.2, 1, 0], 0, 0], [[0, 0, 0.25, 0.75, 1, 1.5], 1, 0, 0], [[0, 0, 1, 0], 1, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [0, 360], [0, 0], 0, 0, [0.35, 0.35], null, 0.001, 1, 1, 0.0011, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "circle", 12, "click:マウスクリック/タップ用2"],
		drag: [[[0, 1, 1, 1], 0, 0], [[0, 1, 0.85, 0.5, 1, 0], 0.999, 0, 0], [[0, 0, 1, 0], 1, 0, 0], [[0, "#96abff", 1, "#172eff"], 0, 0], 0, [0, 0], 0, [0, 360], [0, 0], 0, 0, [0.3, 0.3], 1, 0.0005, 1, 0, 0.0011, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "particle2", 0, "drag:マウスドラッグ用"],

		//水中マップ
		bubble_w: [[[0, 0, 0.2, 0.6, 0.95, 0.6, 1, 0], 0, 0], [[0, 0, 0.2, 0.3, 0.95, 0.7, 1, 0.8], 0.4, 0, 0], [[0, 1, 0.2, 50, 1, 50], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1, 3], null, 0.2, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "bubble1", 6,
			"天候:水中の泡"],
		bubble_cp: [[[0, 0, 0.2, 0.6, 0.9, 0.6, 1, 0], 0, 0], [[0, 0, 0.2, 0.2, 0.9, 0.2, 1, 0.3], 0.1, 0, 0], [[0, 1, 0.2, 100, 1, 100], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1, 3], null, 0.05, 1, 0, 1, 10000, [0, 0], 1, [0, 0], [-24, 0, 48, 0], null, 0, 0, "bubble1", 0,
			"キャラ_play:穴から吹き出す泡"],
		bubble_c: [[[0, 0, 0.5, 0.7, 1, 0], 0, 0], [[0, 1, 1, 1.3], 1, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1, 1], null, 0.5, 1, 0, -1, 10000, [0, 0], 2, [0, 0], null, [0, -26, 3, 0], 0, 0, "bubble1", 3,
			"キャラ:キャラを包む泡。attach推奨"],
		light_pillar_w: [[[0, 0.5, 1, 0.51], 0, 0], [[0, 4, 1, 4.01], 2, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [90, 90], [0, 0], 0, 0, [99999, 99999], 1, 0.001, 1, 1, -1, 12, [0, 0], 1, [0, 0], [-616, -500, 1232, 300], null, 0, 0, "line_oval1", 6,
			"天候:上部からの光柱。横スク用マップ用"],
		fog_w: [[[0, 0, 0.05, 0.05, 0.9, 0.05, 1, 0], 0, 0], [[0, 4, 0.5, 4, 1, 4], 0.3, 0, 0], [[0, 70, 1, 70], 0.3, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 1, [0, 0], 0, [0, 0], [0, 0], 0, 0, [30, 30], 1, 0.3, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-508, -312, 0, 624], null, 0, 0, "cloud3,cloud2,cloud1", 6,
			"天候:薄いフォグ"],
		fish_w: [[[0, 0, 0.1, 0.4, 0.9, 0.4, 1, 0], 0, 0], [[0, 1.01, 1, 1], 0.3, 0, 0], [[0, 130, 0.2, 180, 0.4, 60, 0.6, 120, 0.8, 180, 1, 60], 0.5, 0, 0], [[0, "#000000", 1, "#000000"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [10, 10], 2, 1, 1, 0, -1, 10000, [1, 0.01], 1, [0, 0], [-500, -312, 50, 624], null, 0, 0, "fish1", 6,
			"天候:水中の影"],
		mahoujin_c: [[[0, 0, 0.1, 1, 0.2, 0, 0.3, 1, 0.4, 0, 0.5, 1, 0.6, 0, 0.7, 0, 0.8, 1, 0.9, 0, 1, 0], 0, 0], [[0, 0, 0.2, 0.2, 0.5, 0.2, 1, 0], 0.5, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#56ff89", 0.5, "#52fffc", 1, "#b3ff25"], 0, 0], 1, [0, -100], 0, [0, 0], [0, 0], 0, 0, [1, 1], 1, 0.03, 1, 0, -1, 10000, [0, 0], 3, [0, 0], null, [0, -18, 40, 0], 0, 0, "particle2", 0,
			"キャラ:魔法陣上のキラキラ光粒"],
		mahoujin_c2: [[[0, 0, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.2, 1, 0.5, 1, 1, 0], 0.8, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#ff3287", 1, "#566dff"], 0, 0], 0, [0, -150], 0, [0, 0], [0, 0], 0, 0, [1, 1], 1, 0.04, 1, 0, -1, 10000, [0, 0], 3, [0, 0], null, [0, -60, 64, 0], 0, 0, "line2,line_oval2", 0,
			"キャラ:魔法陣上の光線演出"],

		//火山マップ
		magma_r: [[[0, 1, 1, 0], 0, 0], [[0, 0, 0.2, 1.5, 0.8, 1.5, 1, 0], 0.5, 0, 0], [[0, 0, 1, 0], 1, 0, 0], [[0, "#ff3007", 0.5, "#ff5959", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [0, 360], [0, 0], 0, 0, [1, 1], 1, 0.1, 1, 0, -1, 1000, [0, 0], 0, [0, 0], null, null, 0, 0, "particle4", 7,
			"リージョン:マグマの床"],
		sparks_w: [[[0, 1, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.1, 0.15, 0.5, 0.15, 1, 0], 0.5, 0, 0], [[0, 120, 1, 50], 0.3, 0, 0], [[0, "#ff2c00", 1, "#ffbfb1"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 2, [0.8, 1.5], 1, 0.1, 1, 0, -1, 10000, [3, 0.1], 1, [0, 0], [-408, -224, 816, 524], null, 0, 0, "flame1", 6,
			"天候:薄っすらと舞い上がる火の粉"],
		sparks_c: [[[0, 1, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.5, 0.3, 1, 0], 0.5, 0, 0], [[0, 1, 1, 1], 0.5, 0, 0], [[0, "#ff5500", 1, "#ff8d54"], 0, 0], 0, [0, -100], 0, [-90, -90], [0, 0], 0, 2, [1, 1], 1, 0.1, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-18, -36, 36, 24], null, 0, 0, "flame1", 0,
			"キャラ:焚き火の火の粉"],
		smoke_c: [[[0, 0, 0.5, 0.8, 1, 0], 0, 0], [[0, 1, 1, 0.8], 1, 0, 0], [[0, 1, 1, 100], 0.5, 0, 0], [[0, "#7b7b7b", 0.5, "#525252", 1, "#525252"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1.5, 2], 0, 0.3, 1, 0, -1, 10000, [0, 0], 0, [0, -64], null, null, 0, 0, "smoke1,smoke2", 0,
			"キャラ:焚き火の煙"],
		fire_c: [[[0, 0, 0.2, 1, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.2, 1, 0.5, 1, 1, 0], 0, 0, 0], [[0, 1, 0.2, 250, 1, 150], 0.5, 0, 0], [[0, "#ff2e2e", 1, "#ffb92e"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1, 1], 1, 0.005, 0.5, 1, -1, 10000, [0, 0], 1, [0, 0], [-48, 12, 96, 0], null, 0, 0, "smog2,smoke2,smoke1", 0,
			"キャラ:大きな炎"],
		smoke_c2: [[[0, 0, 0.5, 0.5, 1, 0], 0, 0], [[0, 0, 0.5, 3, 1, 1], 0.5, 0, 0], [[0, 1, 0.2, 250, 1, 150], 0.5, 0, 0], [[0, "#ffffff", 1, "#7b7b7b"], 0, 0], 1, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1, 1], 4, 0.01, 0.5, 1, -1, 10000, [0, 0], 2, [0, 0], null, [0, -36, 80, 0], 0, 0, "smoke2,smoke1,smog1", 0,
			"キャラ:fire用の大きな煙"],
		explode_cp_1: [[[0, 0, 0.2, 0.5, 1, 0.5], 0, 0], [[0, 5, 0.4, 1, 1, 0], 1, 0, 0], [[0, 1, 0.3, 1, 1, 1], 1, 0, 0], [[0, "#ffffff", 1, "#ff7749"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [0.24, 0.24], null, 0.01, 1, 1, 0.011, 1, [0, 0], 0, [0, -24], null, null, 0, 0, "circle2", 0,
			"キャラ:爆発前のサークル収束"],
		explode_cp_2: [[[0, 1, 0.2, 1, 0.7, 1, 1, 0], 0, 0], [[0, 1, 0.15, 6, 0.3, 1, 0.45, 8, 0.6, 1, 0.8, 10, 1, 12], 0.1, 0, 0], [[0, 500, 0.3, 100, 1, 0], 0.3, 0, 0], [[0, "#ff7f7f", 1, "#ff7f30"], 0, 0], 0, [0, 0], 0, [0, 360], [0, 0], 0, 0, [0.3, 1], 1, 0.001, 1, 1, 0.03, 10000, [0, 0], 0, [0, -24], null, null, 0, 0, "smog1", 0,
			"キャラ:爆発の炎"],

		explode_cp_3: [[[0, 0.6, 0.2, 0.4, 1, 0], 0, 0], [[0, 0, 0.18, 4, 1, 4.5], 1, 0, 0], [[0, 1, 0.3, 1, 1, 1], 1, 0, 0], [[0, "#ffffff", 1, "#ff7749"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [1, 1], null, 0.04, 1, 0.05, 1, 1, [0, 0], 0, [0, -24], null, null, 0, 0, "circle2", 0,
			"キャラ:爆発時のサークル発散"],
		explode_cp_4: [[[0, 0, 0.1, 0.8, 0.3, 0.8, 0.4, 0, 0.5, 0.8, 0.7, 0.8, 0.8, 0, 0.9, 0.8, 1, 0], 0, 0], [[0, 0.6, 1, 0.3], 0.3, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#ff7824", 0.5, "#ffffff", 1, "#ff1515"], 0, 0], 1, [0, 0], 0, [0, 360], [0, 0], 0, 0, [0.3, 0.7], 1, 0.005, 0.8, 1, 0.25, 100, [0, 0], 3, [0, 0], null, [0, -24, 130, 0], 0, 0, "circle2", 0,
			"キャラ:爆発後のチカチカする円"],

		//花火マップ
		fireworks_c: [[[0, 0, 0.11, 1, 0.5, 1, 1, 0], 0, 0], [[0, 0.1, 0.15, 0.1, 0.8, 0.05, 1, 0], 0.8, 0, 0], [[0, 1200, 0.1, 200, 0.2, 50, 1, 1], 0.1, 0, 0], [[0, "#ff8d8d", 0.4, "#ffffff", 1, "#ffa83e"], 0, 0], 1, [0, 0], 0, [0, 360], [50, -50], 0, 0, [2, 2], 1, 0.1, 1, 200, 0.11, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "flare", 0,
			"キャラ:打ち上げ花火"],
		fireworks_dragon_c: [[[0, 1, 0.8, 1, 1, 0], 0, 0], [[0, 0.2, 1, 0], 0.8, 0, 0], [[0, 800, 0.3, 200, 1, 0], 0.5, 0, 0], [[0, "#ff8d8d", 0.4, "#ffffff", 1, "#ffa83e"], 0, 0], 1, [0, 100], 0, [-75, -105], [50, -50], 0, 0, [0.7, 1], 1, 0.01, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "smog2", 0,
			"キャラ:噴出タイプの花火"],
		// fireworks_niagala_c:[[[0,1,0.8,1,1,0],0,0],[[0,0.3,0.8,0.15,1,0],0.8,0,0],[[0,10,1,350],1,0,0],[[0,"#ff8d8d",0.4,"#ffffff",1,"#ffa83e"],0,0],1,[0,0],0,[90,90],[50,-50],0,0,[0.7,1],1,0.003,1,1,-1,10000,[0,0],1,[0,0],[-120,-45,230,0],null,0,0,"smog2",0,
		// 	"キャラ:滝タイプの花火"],
		light_leak_s: [[[0, 0, 0.5, 0.1, 1, 0], 0, 0], [[0, 20, 1, 20], 0.2, 0, 0], [[0, 15, 1, 14], 0.5, 0, 0], [[0, "#00ff0c", 0.5, "#fff500", 1, "#ff5f5f"], 0, 0], 1, [0, 0], 0, [0, 0], [0, 0], 0, 0, [3, 5], 1, 0.15, 0.5, 0, -1, 10000, [2, 0.02], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "particle4", 5,
			"スクリーン:淡いライトリーク"],

		//雪マップ
		blizard_w: [[[0, 1, 0.8, 1, 1, 0], 0, 0], [[0, 0.41, 1, 0.4], 0.3, 0, 0], [[0, 2000, 1, 2000], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [15, 30], [0, 0], 0, 0, [0.13, 0.13], 1, 0.001, 1, 5, -1, 10000, [0, 0], 1, [0, 0], [-408, -412, 916, 624], null, 0, 0, "snow_particle2,snow_particle1", 6,
			"天候:吹雪"],
		snow_w: [[[0, 0, 0.2, 1, 1, 0], 0, 0], [[0, 0.2, 1, 0.2], 0.5, 0, 0], [[0, 100, 1, 100], 1, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [90, 90], [-100, 100], 0, 0, [20, 30], 1, 0.1, 1, 0, -1, 10000, [1, 0.01], 1, [0, 0], [-408, -440, 916, 40], null, 0, 0, "snow_particle1", 6,
			"天候:うっすらと降る雪"],
		snow_w2: [[[0, 0, 0.3, 0.6, 1, 0], 0, 0], [[0, 0.31, 1, 0.3], 0.1, 0, 0], [[0, 50, 1, 50], 0.75, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [90, 90], [-50, 50], 0, 0, [5, 10], 1, 0.1, 1, 0, -1, 10000, [2, 0.01], 1, [0, 0], [-408, -412, 916, 624], null, 0, 0, "snow2,snow5g", 6,
			"天候:雪の結晶"],
		diamonddust_w: [[[0, 0, 0.5, 1, 1, 0], 0, 0], [[0, 0.8, 1, 0.81], 0.2, 0, 0], [[0, 15, 1, 14], 0.5, 0, 0], [[0, "#b2f7ff", 1, "#d6ffe1"], 0, 0], 1, [0, 0], 0, [0, 360], [-120, 120], 0, 0, [1.2, 1.8], 1, 0.1, 1, 0, -1, 10000, [2, 0.02], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "shine_thin3", 6,
			"天候:キラキラ漂うダイヤモンドダスト"],
		diamonddust_w2: [[[0, 0, 0.5, 1, 1, 0], 0, 0], [[0, 0.6, 1, 0.61], 0.3, 0, 0], [[0, 15, 1, 14], 0.5, 0, 0], [[0, "#92ff7b", 1, "#89d7ff"], 0, 0], 1, [0, 0], 0, [0, 360], [-120, 120], 0, 0, [1, 1.5], 1, 0.03, 1, 0, -1, 10000, [2, 0.02], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "shine_thin3", 6,
			"天候:キラキラ漂うダイヤモンドダスト2"],
		illumination_w: [[[0, 0, 0.5, 1, 1, 0], 0, 0], [[0, 0.8, 1, 0.81], 0.2, 0, 0], [[0, 15, 1, 14], 0.5, 0, 0], [[0, "#e0ff14", 0.25, "#3c00ff", 0.5, "#ff4d00", 0.75, "#00bbff", 1, "#00ff45"], 0, 0], 1, [0, 0], 0, [0, 360], [-120, 120], 0, 0, [1.2, 1.8], 1, 0.03, 1, 0, -1, 10000, [2, 0.02], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "shine_thin3,particle4,flare2", 6,
			"天候:カラフルなイルミネーション"],
		light_leak_s2: [[[0, 0, 0.5, 0.3, 1, 0], 0, 0], [[0, 1, 1, 1], 0.3, 0, 0], [[0, 15, 1, 14], 0.5, 0, 0], [[0, "#92ff7b", 1, "#89d7ff"], 0, 0], 1, [0, 0], 0, [0, 360], [-120, 120], 0, 0, [2, 4], 1, 0.4, 1, 0, -1, 10000, [2, 0.02], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "flare", 5,
			"スクリーン:青&緑のライトリーク"],
		kira_blue_c: [[[0, 1, 0.5, 1, 1, 0], 0, 0], [[0, 1, 0.5, 1, 1, 0], 0.2, 0, 0], [[0, 60, 1, 0], 0.2, 0, 0], [[0, "#e0e6ff", 1, "#a3ffc8"], 0, 0], 0, [0, 0], 0, [-90, -90], [-90, 90], 0, 0, [0.5, 1], 1, 0.5, 1, 3, -1, 10000, [0, 0], 1, [0, 0], [-24, 0, 48, -48], null, 0, 0, "shine_thin3", 0,
			"キャラ:青いキラキラエフェクト"],

		//闇マップ
		dark_hole_r: [[[0, 1, 0.1, 1, 0.15, 0, 0.2, 1, 0.4, 1, 0.45, 0, 0.5, 1, 0.8, 1, 0.84, 0, 0.88, 1, 0.92, 0, 0.96, 1, 1, 0], 0, 0], [[0, 0.35, 0.5, 0.25, 1, 0], 0.2, 0, 0], [[0, 200, 1, 100], 0.3, 0, 0], [[0, "#1a6dad", 1, "#a3ffc8"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [0.5, 1.5], 0, 0.3, 1, 0, -1, 10000, [3, 0.01], 0, [0, 0], null, null, 0, 0, "shine2", 7,
			"リージョン:穴からキラキラ吹き上げる光"],
		dark_hole_r_2: [[[0, 1, 0.5, 1, 1, 0], 0, 0], [[0, 1, 0.5, 1, 1, 0], 0.3, 0, 0], [[0, 200, 1, 100], 1, 0, 0], [[0, "#073f74", 1, "#78f4e1"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [0.8, 0.8], 1, 0.1, 1, 0, -1, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "line_oval3", 7,
			"リージョン:穴から吹き上げる線形の光"],
		dark_hole_r_3: [[[0, 0, 0.5, 0.3, 1, 0], 0, 0], [[0, 0, 0.5, 2, 1, 3], 0.5, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#00acff", 1, "#b70eff"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 2, [0.5, 1.5], 3, 0.5, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "smoke2", 7,
			"リージョン:穴の中のもやもや"],
		poison_r: [3, [[0, 0, 0.5, 0.5, 1, 0]], [[0, 0, 0.8, 0.4, 1, 0.5], 0.25], [[0, 1, 1, 1], 1], [[0, "#57005f", 1, "#69005d"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, [0.6, 1.2], 2, 0.5, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "circle2", 7,
			"リージョン:毒の沼"],
		darkness_s: [3, [[0, 0, 0.5, 0.8, 1, 0]], [[0, 8, 0.5, 8, 1, 8], 0.5], [[0, 1, 1, 1], 1], [[0, "#000000", 1, "#000000"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, [2, 2], 2, 0.04, 1, 1, -1, 10000, [0, 0], 3, [0, 0], [0, 0, 450, 400], 0, 0, "smoke2,cloud2s", 5,
			"スクリーン:暗闇の視界制限"],
		monster_cp: [3, [[0, 0, 0.1, 1, 0.9, 1, 1, 0]], [[0, 5, 1, 0.3], 0.3], [[0, -220, 1, -220], 1], [[0, "#3714ff", 1, "#0022ff"]], 0, [0, 0], null, [0, 0], [0, 0], 0, 0, [0.3, 0.8], 1, 0.01, 1, 2, 0.4, 10000, [0, 0], 3, [0, 0], [0, -24, 100, 80], 0, 0, "particle4", 0,
			"キャラ:パーティクルが収束"],
		monster_cp2: [3, [[0, 0, 0.3, 1, 1, 0]], [[0, 2.5, 0.3, 1, 1, 0.5], 0.8], [[0, 1200, 0.2, 200, 1, 0], 0.8], [[0, "#7b00ff", 1, "#c99bff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, [0.4, 0.8], 1, 0.01, 1, 3, 0.1, 10000, [0, 0], 0, [0, -24], null, 0, 0, "line_oval2", 0,
			"キャラ:集中線が発散。"],
		monster_c: [3, [[0, 0, 0.2, 1, 0.8, 1, 1, 0]], [[0, 0.75, 1, 0], 0.5], [[0, 120, 1, 121], 0.5], [[0, "#da9fff", 1, "#ec6dff"]], 0, [0, -30], null, [30, -210], [0, 0], 0, 0, [1, 1.5], 1, 0.1, 1, 1, -1, 10000, [0, 0], 0, [0, -12], null, 0, 0, "particle2", 0,
			"キャラ:中央から光球が発生して上に"],
		aura_bp: [3, [[0, 1, 0.7, 1, 1, 0]], [[0, 2, 0.15, 0.8, 0.7, 0.8, 1, 0], 0.5], [[0, 1500, 0.15, 50, 0.7, 50, 1, 100], 0.2], [[0, "#8dfffd", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, [1, 1], 1, 0.0015, 1, 1, 0.1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "snow_particle2g,line_oval3", 8,
			"戦闘キャラ:青白い光の粒＆集中線発散"],
		aura_bp2: [3, [[0, 1, 0.2, 1, 1, 0]], [[0, 0, 0.18, 4, 1, 4.5], 1], [[0, 1, 0.3, 1, 1, 1], 1], [[0, "#ffffff", 1, "#49d5ff"]], 0, [0, 0], null, [0, 0], [0, 0], 0, 0, [1, 1], 1, 0.04, 1, 0.05, 1, 1, [0, 0], 0, [0, 0], null, 0, 0, "circle3g", 8,
			"戦闘キャラ:青白いサークル拡大"],

		//天界,
		light_pillar_r: [3, [[0, 0, 0.3, 0.5, 0.7, 0.5, 1, 0]], [[0, 3, 1, 3], 0.4], [[0, 1, 1, 0], 1], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [90, 90], [0, 0], 0, 0, [5, 5], 1, 1, 0.02, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "line_oval3", 7,
			"リージョン:空エリアの光の柱"],
		light_floor_r: [3, [[0, 0, 0.5, 1, 0.55, 0, 0.6, 1, 0.65, 0, 0.7, 1, 0.75, 0, 0.8, 1, 0.85, 0, 0.9, 1, 0.95, 0, 1, 0]], [[0, 0, 0.5, 0.2, 1, 0], 0.5], [[0, 20, 1, 20], 0.5], [[0, "#ffea00", 1, "#ffea00"]], 0, [0, -50], null, [-90, -90], [-120, 120], 0, 0, [1, 2], 1, 1, 1, 1, -1, 10000, [0, 0], 2, [0, 0], [0, -12, 32, 0], 0, 0, "shine3", 7,
			"リージョン:キラキラ点滅する小さな光粒"],
		particle_w: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.6, 1, 0.6], 0.2], [[0, 40, 1, 40], 0.2], [[0, "#ffc2c2", 1, "#fffdb9"]], 1, [0, -10], null, [-90, -90], [0, 0], 0, 0, [1.5, 4], 1, 0.1, 1, 1, -1, 10000, [5, 0.2], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8,particle5", 6,
			"天候:ゆらゆら上昇する光粒"],
		orb_c: [3, [[0, 0.5, 1, 0]], [[0, 0, 0.1, 2, 1, 3.5], 0.8], [[0, 1, 1, 1], 1], [[0, "#00d0ff", 1, "#a6eeff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, [0.6, 0.6], 1, 0.1, 1, 1, -1, 10000, [0, 0], 0, [0, -24], null, 0, 0, "ripple1g", 0,
			"キャラ:オーブの波動"],
		orb_cp: [3, [[0, 1, 1, 0]], [[0, 0, 0.1, 1, 1, 0], 0.8], [[0, 800, 0.1, 200, 1, 1], 0.5], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, [0.5, 0.7], 1, 0.005, 1, 1, 0.1, 10000, [0, 0], 0, [0, -26], null, 0, 0, "shine3", 0,
			"キャラ_play:青白いキラキラ光粒が発散"],
		light_float_cp: [3, [[0, 1, 1, 0]], [[0, 3, 1, 0], 0.2], [[0, 500, 1, 1], 0.5], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, [0.4, 0.8], 1, 0.003, 1, 1, 0.15, 10000, [0, 0], 1, [0, 0], [-18, -150, 36, 0], 0, 0, "line_oval3", 0,
			"キャラ_play:光柱が頭上に向かって消える"],
		statue_orb_c: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.5, 1, 0], 0.5], [[0, 1, 1, 80], 0.5], [[0, "#ffff00", 1, "#460000"]], 0, [0, 0], null, [-180, 0], [0, 0], 0, 0, [1, 1], 1, 0.1, 1, 1, -1, 10000, [0, 0], 0, [0, -22], null, 0, 0, "cloud2", 0,
			"キャラ:石像のオーブから出る光粒"],
		magic_circle_c: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.25, 1, 0], 0.5], [[0, 50, 1, 50], 0.5], [[0, "#ff0707", 1, "#ffcdcd"]], 0, [0, -30], null, [-90, -90], [-120, 120], 0, 0, [0.5, 1.5], 2, 0.05, 1, 1, -1, 10000, [0, 0], 2, [0, 0], [0, -24, 24, 0], 0, 0, "hexagon_line3,hexagon1", 0,
			"キャラ:魔法陣の幾何学エフェクト"],
		warp_red_c: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0, 0.5, 1.5, 1, 0], 0.5], [[0, 10, 1, 150], 1], [[0, "#ff3030", 1, "#ff1d1d"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, [0.5, 1], 2, 0.03, 1, 1, -1, 10000, [0, 0], 0, [0, -24], null, 0, 0, "line_oval3,line_oval2", 0,
			"キャラ:赤魔法陣ワープの集中線"],
		warp_red_cp: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.5, 0.5, 0.2, 1, 0], 0.5], [[0, 1000, 0.2, 200, 1, 0], 0.5], [[0, "#9100ff", 1, "#ff0000"]], 1, [0, 0], null, [-90, -90], [-360, 360], 0, 0, [0.5, 1], 2, 0.01, 1, 1, 0.3, 10000, [0, 0], 2, [0, -24], [0, 12, 36, 0], 0, 0, "square_line1", 0,
			"キャラ:ワープ直後の幾何学エフェクト"],




		//歩行
		fuss_startdash: [[[0, 0, 0.1, 0.8, 0.5, 0.5, 1, 0], 0, 0], [[0, 0, 0.2, 0.5, 0.9, 0.5, 1, 0.12], 0.5, 0, 0], [[0, 500, 0.2, 50, 1, 0], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-60, -120], [-100, 100], 0, 0, [0.6, 1.2], 4, 0.01, 1, 3, 0.05, 60, [0, 0], 0, [0, 0], null, null, 0, 0, "cartoon_fuss1", 2,
			"スタートダッシュ:アニメ調の煙"],
		fuss_walk: [[[0, 0, 0.1, 0.8, 0.5, 0.5, 1, 0], 0, 0], [[0, 0, 0.3, 0.5, 0.9, 0.5, 1, 0.12], 0.5, 0, 0], [[0, 150, 1, 0], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-60, -120], [0, 0], 0, 0, [0.5, 1], 4, 0.1, 1, 3, -1, 60, [0, 0], 0, [0, 0], null, null, 0, 0, "cartoon_fuss2", 1,
			"歩行:アニメ調の煙"],
		dust_walk: [[[0, 0, 0.1, 0.3, 1, 0], 0, 0], [[0, 0, 0.05, 1.5, 1, 2], 0.5, 0, 0], [[0, 100, 1, 0], 0.5, 0, 0], [[0, "#a4724c", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-150, -30], [0, 0], 0, 0, [0.7, 1.2], 0, 0.08, 0.7, 1, -1, 60, [0, 0], 2, [0, 0], null, [0, -6, 12, 0], 0, 0, "smog1", 1,
			"歩行:土煙"],
		grass_walk: [[[0, 0, 0.1, 0.8, 0.5, 0.5, 1, 0], 0, 0], [[0, 0, 0.3, 0.2, 0.9, 0.2, 1, 0.12], 0.5, 0, 0], [[0, 200, 1, 200], 0.8, 0, 0], [[0, "#005b11", 1, "#005b11"], 0, 0], 0, [0, 300], 0, [-30, -150], [-100, 200], 1, 2, [0.4, 0.6], 0, 0.25, 1, 4, -1, 60, [0, 0], 0, [0, 0], null, null, 0, 0, "flame1", 1,
			"歩行:飛び散る草"],
		flower_walk: [[[0, 0, 0.005, 1, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.005, 1, 0.5, 1, 1, 1], 0.5, 0, 0], [[0, 0, 1, 0], 0, 0, 0], [[0, "#ffffff", 0.5, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [0.5, 1.5], 0, 0.025, 1, 1, -1, 1000, [0, 0], 2, [0, 0], null, [0, 0, 24, 0], 0, 0, "tile:Outside_B:192,tile:Outside_B:193,tile:Outside_B:194", 1,
			"歩行:歩いた跡に花(タイル使用)"],
		splash_walk: [[[0, 0, 0.1, 0.8, 0.7, 0.5, 1, 0], 0, 0], [[0, 0, 0.3, 0.25, 0.9, 0.25, 1, 0], 0.3, 0, 0], [[0, 350, 1, 0], 0.5, 0, 0], [[0, "#0047ff", 1, "#ffffff"], 0, 0], 0, [0, 100], 0, [-30, -150], [0, 0], 0, 0, [0.4, 0.5], 1, 0.25, 1, 4, -1, 60, [0, 0], 0, [0, 0], null, null, 0, 0, "snow_particle2", 1,
			"歩行:水しぶき"],
		ripple_walk: [[[0, 0, 0.1, 0.5, 1, 0], 0, 0], [[0, 0, 0.1, 1, 1, 2], 0.4, 0, 0], [[0, 0, 1, 0], 0.5, 0, 0], [[0, "#c2cdff", 1, "#d4e6ff"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [0.5, 1], 1, 0.08, 0.7, 1, -1, 60, [0, 0], 2, [0, 0], null, [0, -4, 6, 0], 0, 0, "ripple2", 1,
			"歩行:水の波紋"],
		fuss_c: [[[0, 0, 0.1, 0.8, 0.5, 0.5, 1, 0], 0, 0], [[0, 0, 0.3, 1, 1, 2], 0.1, 0, 0], [[0, 150, 1, 0], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-60, -120], [0, 0], 0, 0, [0.5, 1], 4, 0.03, 1, 3, 0.5, 30, [0, 0], 1, [0, 0], [-36, 0, 72, 0], null, 0, 0, "cartoon_fuss2", 0,
			"キャラ:乱闘中っぽいアニメ調の煙"],

		//天候
		flash_s: [[[0, 0, 0.2, 0.25, 1, 0], 0, 0], [[0, 6, 1, 6], 0.9, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#ffe8ad", 1, "#ffe8ad"], 0, 0], 1, [0, 0], 0, [0, 360], [0, 0], 0, 0, [1, 1], 1, 0.2, 0.25, 0, -1, 10000, [0, 0], 0, [-500, -550], null, null, 0, 0, "flare", 5,
			"スクリーン:太陽光のフラッシュ"],
		flare_s: [[[0, 0, 0.2, 1, 0.8, 1, 1, 0], 0, 0], [[0, 6, 1, 6], 0.9, 0, 0], [[0, 1, 1, 1], 1, 0, 0], [[0, "#ffb050", 1, "#ffffff"], 0, 0], 1, [0, 0], 0, [0, 360], [0, 0], 0, 0, [1, 1], 1, 0.2, 1, 0, -1, 10000, [0, 0], 0, [-500, -550], null, null, 0, 0, "flare2", 5,
			"スクリーン:太陽光のフレア"],
		fog_w2: [[[0, 0, 0.05, 0.1, 0.9, 0.1, 1, 0], 0, 0], [[0, 4, 0.5, 4, 1, 4], 0.3, 0, 0], [[0, 70, 1, 70], 0.3, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 1, [0, 0], 0, [0, 0], [0, 0], 0, 0, [30, 30], 1, 0.3, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-616, -312, 0, 624], null, 0, 0, "cloud3,cloud2,cloud1", 5,
			"天候:濃いめのモヤ"],
		fog_shadow_w: [[[0, 0, 0.05, 0.05, 0.9, 0.05, 1, 0], 0, 0], [[0, 5, 0.5, 5, 1, 5], 0.25, 0, 0], [[0, 70, 1, 70], 0.3, 0, 0], [[0, "#000000", 1, "#000000"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [30, 30], 2, 0.3, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-616, -312, 0, 624], null, 0, 0, "cloud3,cloud2,cloud1", 5,
			"天候:モヤの影"],
		cloud_w: [[[0, 0, 0.05, 0.75, 0.9, 0.75, 1, 0], 0, 0], [[0, 10, 0.5, 10, 1, 10], 0.3, 0, 0], [[0, 70, 1, 70], 0.3, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [60, 60], 0, 3, 0.5, 0, -1, 10000, [0, 0], 1, [0, 0], [-616, -312, 0, 624], null, 0, 0, "cloud3,cloud2,cloud1", 5,
			"天候:雲"],
		cloud_shadow_w: [[[0, 0, 0.05, 0.2, 0.9, 0.2, 1, 0], 0, 0], [[0, 7, 0.5, 7, 1, 7], 0.3, 0, 0], [[0, 25, 1, 25], 0.3, 0, 0], [[0, "#000000", 1, "#000000"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 0, [70, 70], 0, 3, 0.5, 0, -1, 10000, [0, 0], 1, [0, 0], [-616, -312, 0, 624], null, 0, 0, "cloud3,cloud2,cloud1", 5,
			"天候:雲の影"],
		rain_w: [[[0, 0, 0.2, 0.6, 1, 0], 0, 0], [[0, 0.3, 1, 0.3], 0.5, 0, 0], [[0, 300, 1, 300], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [90, 90], [0, 0], 0, 0, [0.3, 0.5], 1, 0.008, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-408, -412, 916, 624], null, 0, 0, "line_rain2", 6,
			"天候:しとしと雨"],
		rain_w2: [[[0, 0, 0.2, 0.8, 0.8, 0.5, 1, 0], 0, 0], [[0, 0.84, 1, 0.85], 0.5, 0, 0], [[0, 800, 1, 800], 0.75, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [112.5, 112.5], [0, 0], 0, 0, [0.3, 0.4], 0, 0.008, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-408, -412, 916, 624], null, 0, 0, "line_rain1", 6,
			"天候:強めの雨"],
		rain_w3: [[[0, 0, 0.2, 0.8, 0.8, 0.5, 1, 0], 0, 0], [[0, 1.1, 1, 1], 2.5, 0, 0], [[0, 1500, 1, 1500], 0.75, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [112.5, 112.5], [0, 0], 0, 0, [0.15, 0.25], 1, 0.003, 1, 0, -1, 10000, [0, 0], 1, [0, 0], [-408, -412, 916, 624], null, 0, 0, "line2", 6,
			"天候:本降りの雨"],
		ripple_r: [[[0, 0.5, 0.5, 0.5, 1, 0], 0, 0], [[0, 0, 0.5, 0.6, 1, 1], 0.5, 0, 0], [[0, 0, 1, 0], 1, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [0, 0], [0, 0], 0, 2, [0.6, 1], 1, 1, 0.5, 0, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "ripple2", 7,
			"リージョン:水たまりの波紋"],
		rain_fog_w: [[[0, 0, 0.5, 0.2, 1, 0], 0, 0], [[0, 0.5, 1, 1], 1.5, 0, 0], [[0, 50, 0.2, 20, 1, 15], 0.5, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [-90, -90], [0, 0], 0, 2, [1, 2], 1, 0.08, 0.5, 0, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], null, 0, 0, "smoke2", 6,
			"天候:雨天時のモヤ"],
		thunder_w: [[[0, 1, 0.2, 1, 1, 0], 0, 0], [[0, 11, 0.2, 11, 1, 11], 0.2, 0, 0], [[0, 1, 1, 1], 0.5, 0, 0], [[0, "#ffff20", 0.05, "#3300ff", 1, "#c800ff"], 0, 0], 0, [0, 0], 0, [85, 95], [0, 0], 0, 2, [0.5, 1], 1, 0.06, 0.2, 0, -1, 10000, [0, 0.02], 1, [0, 0], [-408, -412, 816, 200], null, 0, 0, "thunder1,thunder2", 6,
			"天候:ピカッと一瞬光る稲妻"],
		thunder_w2: [[[0, 1, 0.2, 1, 1, 0], 0, 0], [[0, 11, 0.2, 11, 1, 11], 0.2, 0, 0], [[0, 1, 1, 1], 0.5, 0, 0], [[0, "#ffff20", 1, "#ffff20"], 0, 0], 0, [0, 0], 0, [85, 95], [0, 0], 0, 2, [0.5, 1], 1, 0.06, 0.2, 0, -1, 10000, [0, 0.02], 1, [0, 0], [-408, -412, 816, 200], null, 0, 0, "thunder1,thunder2", 6,
			"天候:黄色の稲妻"],
		petal_w: [3, [[0, 0, 0.2, 0.8, 0.8, 0.8, 1, 0]], [[0, 0.25, 1, 0.25], 0.75], [[0, 200, 0.5, 100, 1, 200], 0.5], [[0, "#fabfff", 1, "#fce1ff"]], 1, [0, 0], null, [0, 0], [-180, 180], -1, 0, [2, 4], 4, 0.05, 1, 1, -1, 10000, [5, 0.2], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "petal1", 6,
			"天候:桜の花びら"],

		//戦闘
		aura_bp: [3, [[0, 1, 0.7, 1, 1, 0]], [[0, 2, 0.15, 0.8, 0.7, 0.8, 1, 0], 0.5], [[0, 1500, 0.15, 50, 0.7, 50, 1, 100], 0.2], [[0, "#8dfffd", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, [1, 1], 1, 0.0015, 1, 1, 0.1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "snow_particle2g,line_oval3", 0,
			"キャラ_play:青白い粒子と集中線拡散"],
		aura_bp2: [3, [[0, 1, 0.2, 1, 1, 0]], [[0, 0, 0.18, 4, 1, 4.5], 1], [[0, 1, 0.3, 1, 1, 1], 1], [[0, "#ffffff", 1, "#49d5ff"]], 0, [0, 0], null, [0, 0], [0, 0], 0, 0, [1, 1], 1, 0.04, 1, 0.05, 1, 1, [0, 0], 0, [0, 0], null, 0, 0, "circle3g", 0,
			"キャラ_play:青白いサークル拡大"],
		aura_static_b: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0, 1, 0.5], 0.3], [[0, 60, 1, 10], 1], [[0, "#0592ff", 1, "#0592ff"]], 0, [0, -10], null, [0, 360], [-90, 90], -1, 2, [1, 1], 1, 0.01, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "ANIM:Darkness2:12:M", 0,
			"キャラ:もやもやのオーラ(アニメ画像使用)"],
		charm_bw: [3, [[0, 0, 0.3, 1, 1, 0]], [[0, 0, 0.3, 0.4, 1, 0.6], 0.5], [[0, 100, 1, 1], 0], [[0, "#dd00ff", 1, "#ffffff"]], 0, [0, 0], null, [-120, -60], [-90, 90], -1, 0, [1.5, 2.5], 0, 0.1, 1, 1, -1, 1000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "heart4g", 6,
			"天候:画面全体ハート"],
		black_particle_w: [3, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.6, 1, 0.6], 0.2], [[0, 40, 1, 40], 0.2], [[0, "#670088", 1, "#670088"]], 1, [0, -10], null, [-90, -90], [0, 0], 0, 0, [1.5, 4], 2, 0.1, 1, 1, -1, 10000, [5, 0.2], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8,particle5", 6,
			"天候:黒いパーティクル"],


		//テスト用
		particle: [[[0, 0, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.5, 1, 1, 0], 0.5, 0, 0], [[0, 300, 1, 100], 1, 0, 0], [[0, "#ffffff", 1, "#ffffff"], 0, 0], 0, [0, 0], 0, [0, 360], [0, 0], 0, 0, [1, 1], 1, 0.01, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "particle1", 0, "テスト用"],
		light_r: [[[0, 1, 0.5, 1, 1, 0], 0, 0], [[0, 0, 0.5, 1, 1, 0], 0.2, 0, 0], [[0, 10, 1, 100], 0.5, 0, 0], [[0, "#14ff1f", 1, "#ffef9d"], 0, 0], 1, [0, 0], 0, [-90, -90], [0, 0], 0, 0, [1, 2], 0, 0.2, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, null, 0, 0, "particle4", 7, "region:テスト用1"],



		//サブ用
		"commet/h": [4, [[0, 0.8, 1, 0]], [[0, 0.4, 1, 0.4], 0.8], [[0, 200, 0.9, 200, 1, 400], 0.25], [[0, "#fffedf", 1, "#feffef"]], 0, [0, 0], null, [140, 140], [-300, 0], 0, 0, 0, [1.5, 2], 1, 0.5, 0.6, 1, -1, 10000, [0, 0], 1, [0, 0], [-404, -308, 808, 200], 0, 0, "shine2", 0, ""],
		"_sub:0:commet/h": [4, [[0, 1, 1, 0]], [[0, 0.2, 1, 0.2], 0.5], [[0, 0, 1, 0], 0.5], [[0, "#ffe2c4", 1, "#ffffff"]], 0, [0, 0], null, [170, 190], [150, 150], 0, 0, 0, [0.5, 0.8], 1, 0.03, 0.2, 5, -1, 10000, [0, 0], 2, [0, 0], [0, 0, 10, 0], 0, 0, "particle9", 0, ""],
		"_sub:1:commet/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 1.2, 1, 0], 0.5], [[0, 100, 1, 1], 1], [[0, "#f8aaaa", 1, "#ffffff"]], 0, [0, 0], null, [180, 180], [0, 0], 0, 0, 0, [1, 1], 1, 0.1, 1, 1, -1, 10000, [0, 0], 2, [0, 0], [0, 0, 7, 0], 0, 0, "line_oval3", 0, ""],
		"starry_sky/h": [4, [[0, 0, 0.2, 1, 0.25, 0.7, 0.3, 1, 0.35, 0.7, 0.4, 1, 0.45, 0.7, 0.5, 1, 0.55, 0.7, 0.6, 1, 0.65, 0.7, 0.7, 1, 0.75, 0.7, 0.8, 1, 0.85, 0.5, 0.9, 0.65, 1, 0]], [[0, 0.2, 1, 0.2], 0.3], [[0, 0, 1, 0], 1], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [4, 6], 1, 0.05, 1, 1, -1, 10000, [0, 0], 1, [0, 0], [-404, -308, 808, 500], 0, 0, "particle9,particle8,particle7", 0, ""],
		"firefly/h": [4, [[0, 0, 0.2, 1, 0.4, 0.5, 0.5, 1, 0.6, 0.5, 0.8, 1, 1, 0]], [[0, 0.3, 1, 0.3], 0.35], [[0, 50, 1, 50], 0.3], [[0, "#a4fb7b", 1, "#a4fb7b"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [3, 6], 1, 30, 0.5, 1, -1, 10000, [5, 0.3], 1, [0, 0], [0, 0, 0, 0], 0, 0, "particle8", 0, ""],
		"_sub:0:firefly/h": [4, [[0, 1, 1, 0]], [[0, 0.05, 1, 0.05], 0.5], [[0, 10, 1, 0], 1], [[0, "#b3ff86", 1, "#ffffff"]], 0, [0, 0], null, [180, 180], [0, 0], 0, 0, 0, [1.5, 2], 1, 0.15, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "line_ray2,particle7", 0, ""],
		"fireworks_shot/h": [4, [[0, 1, 0.8, 1, 1, 0]], [[0, 0.15, 1, 0.15], 0.5], [[0, 800, 0.5, 300, 0.8, 100, 1, 0], 0.7], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, 0, [1, 1], 1, 0.5, 0.5, 1, -1, 10000, [0, 0], 1, [0, 0], [-312, 0, 624, 0], 0, 0, "particle9", 0, ""],
		"_sub:0:fireworks/h": [4, [[0, 0, 0.11, 1, 0.5, 1, 1, 0]], [[0, 0.1, 0.15, 0.1, 0.8, 0.05, 1, 0], 0.8], [[0, 1200, 0.1, 200, 0.2, 50, 1, 1], 0.1], [[0, "#ff8d8d", 0.4, "#ffffff", 1, "#ffa83e"]], 1, [0, 0], null, [0, 360], [50, -50], 0, 0, 0, [2, 2], 1, 0.1, 1, 200, 0.11, 10000, [0, 0], 1, [0, 0], [0, 0, 0, 0], 0, 0, "flare", 0, ""],
		"_sub:1:fireworks/h": [4, [[0, 0.2, 1, 0]], [[0, 0.5, 1, 0], 0.5], [[0, 0, 1, 0], 1], [[0, "#ffd6c1", 1, "#ffffff"]], 0, [0, 0], null, [175, 185], [0, 0], 0, 0, 0, [0.4, 0.6], 1, 0.01, 1, 1, 0.9, 10000, [1, 0.01], 0, [0, 0], null, 0, 0, "particle9", 0, ""],


		//漂う光(サブ)
		"_auto:0:light_green_w1/h": [4, [[0, 0, 0.33, 1, 0.5, 0.5, 0.67, 1, 1, 0]], [[0, 0, 0.25, 0.25, 1, 0.25], 0.5], [[0, 1, 0.2, 25, 1, 25], 0.2], [[0, "#85ff76", 1, "#76ffe6"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 4], 1, 0.2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_auto:0:light_green_w2/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.5, 1, 0.5], 0.5], [[0, 30, 1, 30], 0.2], [[0, "#85ff76", 1, "#85ff76"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 3], 1, 0.2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_green_w2/h": [4, [[0, 0, 0.5, 0.15, 1, 0]], [[0, 1, 1, 1], 0.5], [[0, 0, 1, 0], 1], [[0, "#b7ff8d", 1, "#b7ff8d"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 2], 1, 0.25, 0.2, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],
		"_auto:0:light_green_w3/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 0, 0.5, 0.5, 1, 0], 0.1], [[0, 20, 1, 20], 0.5], [[0, "#7bffae", 1, "#ccff7b"]], 1, [0, -25], null, [-60, -120], [0, 0], 0, 0, 0, [2, 4], 1, 0.2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_sub:0:light_green_w3/h": [4, [[0, 1, 1, 0]], [[0, 0, 0.2, 0.4, 1, 0], 0.5], [[0, 0, 1, 0], 1], [[0, "#a2fff1", 1, "#9dff9f"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1.5, 2], 1, 0.1, 0.25, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle9", 0, ""],

		"_auto:0:light_black_w1/h": [4, [[0, 0, 0.25, 0.9, 0.75, 0.9, 1, 0]], [[0, 0, 0.25, 0.2, 1, 0.2], 0.5], [[0, 30, 1, 30], 0.2], [[0, "#2542bf", 1, "#9125bf"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 3], 2, 0.07, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle7", 6, ""],
		"_auto:0:light_black_w2/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.5, 1, 0.7], 0.5], [[0, 40, 1, 40], 0.3], [[0, "#491cb8", 1, "#143c88"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 3], 2, 0.2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_sub:0:light_black_w2/h": [4, [[0, 1, 1, 0]], [[0, 0.5, 1, 0], 0.4], [[0, 40, 1, 10], 0.2], [[0, "#6c52ff", 1, "#6c52ff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 2, 0.05, 0.25, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_auto:0:light_black_w3/h": [4, [[0, 0, 0.25, 0.9, 0.75, 0.9, 1, 0]], [[0, 0, 0.25, 0.2, 1, 0.2], 0.5], [[0, 60, 1, 60], 0.1], [[0, "#2542bf", 1, "#9125bf"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 3], 2, 0.125, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle7", 6, ""],
		"_sub:0:light_black_w3/h": [4, [[0, 1, 1, 0]], [[0, 0, 0.2, 0.4, 1, 0], 0.5], [[0, 0, 1, 0], 1], [[0, "#781eff", 1, "#2b2fff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 2.5], 2, 0.1, 0.25, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_sub:1:light_black_w3/h": [4, [[0, 0, 0.1, 0.1, 1, 0]], [[0, 0.7, 1, 0.7], 0.1], [[0, 0, 1, 0], 1], [[0, "#3630df", 1, "#131162"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 2, 0.2, 0.15, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],

		"_auto:0:light_ash_w1/h": [4, [[0, 0, 0.25, 0.9, 0.5, 0.8, 0.75, 0.9, 1, 0]], [[0, 0.35, 1, 0.35], 0.3], [[0, 20, 1, 20], 0.2], [[0, "#d4d4d4", 1, "#8d8d8d"]], 1, [0, 0], null, [0, 360], [90, -90], 0, 0, 0, [4, 6], 0, 0.05, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "dust4,dust2,dust3,dust1", 6, ""],
		"_auto:0:light_ash_w2/h": [4, [[0, 0, 0.25, 0.9, 0.5, 0.8, 0.75, 0.9, 1, 0]], [[0, 0.35, 1, 0.35], 0.3], [[0, 20, 1, 20], 0.2], [[0, "#ff9e8d", 1, "#ffc988"]], 1, [0, 0], null, [0, 360], [90, -90], 0, 0, 0, [4, 6], 1, 0.2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "dust4g,dust2g,dust1g,dust3g", 6, ""],
		"_sub:0:light_ash_w2/h": [4, [[0, 0, 0.2, 0.15, 1, 0]], [[0, 0.4, 1, 0.4], 0], [[0, 1, 1, 1], 1], [[0, "#ff9940", 1, "#ff6f6f"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 2], 1, 0.5, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],

		"_auto:0:light_ice_w1/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.35, 1, 0.35], 0.2], [[0, 20, 1, 20], 0.2], [[0, "#8be1ff", 1, "#b9bcff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [3, 6], 1, 0.2, 1, 1, -1, 10000, [5, 0.02], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_auto:0:light_ice_w2/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 1, 1, 1], 0.5], [[0, 30, 1, 30], 0.2], [[0, "#76ffea", 1, "#c1e1ff"]], 0, [0, 0], null, [-90, -90], [90, -90], 0, 0, 0, [1.5, 3], 1, 0.35, 1, 1, -1, 10000, [5, 0.01], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "dust1g", 6, ""],
		"_sub:0:light_ice_w2/h": [4, [[0, 0.15, 1, 0]], [[0, 0.7, 1, 0.7], 0.15], [[0, 0, 1, 0], 1], [[0, "#72e5ff", 1, "#6b97ff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 1, 0.2, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],
		"_auto:0:light_ice_w3/h": [4, [[0, 0, 1, 0]], [[0, 0, 1, 0], 0.5], [[0, 80, 1, 80], 0.3], [[0, "#add5ff", 1, "#76a6ff"]], 0, [0, 0], null, [-100, -80], [0, 0], 0, 0, 0, [2, 3], 1, 0.25, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "shine2,shine_thin1g,shine_thin3,particle9", 6, ""],
		"_sub:0:light_ice_w3/h": [4, [[0, 0, 0.19, 0, 0.2, 1, 0.49, 1, 0.5, 0, 0.51, 1, 0.69, 1, 1, 0]], [[0, 0.5, 0.1, 0.4, 1, 0], 0.2], [[0, 0, 1, 0], 1], [[0, "#8bfffd", 1, "#7291ff"]], 1, [0, 0], null, [0, 360], [90, -90], 0, 0, 0, [0.5, 1], 1, 0.2, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "shine_thin3,shine3,shine_thin1g", 0, ""],
		"_sub:1:light_ice_w3/h": [4, [[0, 0, 0.2, 1, 1, 0]], [[0, 0.5, 1, 0], 0.2], [[0, 10, 1, 10], 1], [[0, "#8bfffd", 1, "#7291ff"]], 1, [0, 0], null, [0, 360], [90, -90], 0, 0, 0, [1, 2], 1, 0.1, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle9", 0, ""],

		"_auto:0:light_red_w1/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.5, 1, 0.5], 0.5], [[0, 30, 1, 30], 0.2], [[0, "#ffb9af", 1, "#ff1b1b"]], 1, [0, -5], null, [-90, -90], [0, 0], 0, 0, 0, [2, 3], 1, 0.04, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "dust4g,dust3g,dust1g,dust2g", 6, ""],
		"_auto:0:light_red_w2/h": [4, [[0, 0, 1, 0]], [[0, 0, 1, 0], 0.5], [[0, 50, 1, 50], 0.2], [[0, "#ffffff", 1, "#ffffff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [0.1, 0.1], 1, 0.07, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_sub:0:light_red_w2/h": [4, [[0, 0, 0.1, 1, 1, 0]], [[0, 0.5, 0.5, 0.4, 1, 0], 0.5], [[0, 300, 0.15, 50, 1, 0], 0.2], [[0, "#ff9e3e", 1, "#ffd5d1"]], 0, [0, -20], null, [0, 360], [0, 0], 0, 0, 0, [0.5, 1], 1, 0.01, 0.5, 10, 0.011, 10000, [0, 0], 0, [0, 0], null, 0, 0, "dust2g,dust4g,dust1g,dust3g", 0, ""],
		"_auto:0:light_red_w3/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 0, 0.1, 1, 0.5, 1, 1, 0], 0.1], [[0, 50, 0.5, 100, 1, 50], 0.5], [[0, "#ffa77b", 1, "#ffb27b"]], 1, [0, -1], null, [0, 360], [0, 0], 0, 0, 0, [2, 3], 1, 0.35, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_sub:0:light_red_w3/h": [4, [[0, 0, 0.2, 1, 1, 0]], [[0, 0.5, 1, 0], 0.5], [[0, 0, 1, 0], 1], [[0, "#ff8e77", 1, "#ff9756"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [0.5, 1.5], 1, 0.035, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle9", 0, ""],

		"_auto:0:light_blue_w1/h": [4, [[0, 0, 0.25, 1, 0.5, 0.75, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.4, 1, 0.4], 0.2], [[0, 30, 1, 30], 0.2], [[0, "#76daff", 1, "#769bff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [3, 4], 1, 0.2, 1, 1, -1, 10000, [3, 0.02], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_blue_w1/h": [4, [[0, 0, 0.5, 0.25, 1, 0]], [[0, 1.2, 1, 1.2], 0.5], [[0, 0, 1, 0], 1], [[0, "#76fffc", 1, "#76a6ff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 2], 1, 0.5, 0.25, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],
		"_auto:0:light_blue_w2/h": [4, [[0, 1, 0.5, 1, 1, 1]], [[0, 0, 0.5, 0.4, 1, 0], 0.5], [[0, 75, 1, 75], 0.5], [[0, "#80fffc", 1, "#80fffc"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 3.5], 1, 0.3, 0.5, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_sub:0:light_blue_w2/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.3, 1, 0], 0.1], [[0, 75, 1, 0], 1], [[0, "#96ddff", 1, "#a0a0ff"]], 1, [0, 10], null, [0, 360], [0, 0], 0, 0, 0, [0.5, 1], 1, 0.15, 1, 3, -1, 10000, [0, 0], 3, [0, 0], [0, 0, 0, 0], 0, 0, "particle9", 0, ""],
		"_auto:0:light_blue_w3/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.5, 1, 0.5], 0.2], [[0, 50, 1, 50], 0.2], [[0, "#7b9dfb", 1, "#77d4ff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 3], 1, 0.4, 0.6, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_blue_w3/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 2, 0.2, 1, 1, 0], 0], [[0, 10, 1, 10], 1], [[0, "#4ce6f1", 1, "#527cef"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1.5], 1, 0.1, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle5", 0, ""],

		"_auto:0:light_white_w1/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 0, 0.25, 0.4, 0.75, 0.4, 1, 0], 0.5], [[0, 10, 1, 10], 0.2], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [3, 5], 1, 0.15, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_auto:0:light_white_w2/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.3, 1, 0.3], 0], [[0, 70, 1, 70], 0.25], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, -10], null, [-120, -60], [0, 0], 0, 0, 0, [3, 4], 1, 0.5, 1, 1, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_white_w2/h": [4, [[0, 0, 0.2, 1, 1, 0]], [[0, 0.5, 1, 0.5], 0], [[0, 10, 1, 10], 0], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, 0, [3, 4], 1, 0.1, 0.25, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_auto:0:light_white_w3/h": [4, [[0, 0, 0.5, 1, 1, 0]], [[0, 0.5, 1, 0.5], 0], [[0, 20, 1, 20], 1], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, 0, [2, 3], 1, 0.1, 1, 1, -1, 10000, [1, 0.01], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],

		"_auto:0:light_purple_w1/h": [4, [[0, 0, 0.25, 1, 0.75, 1, 1, 0]], [[0, 0.3, 1, 0.3], 0.1], [[0, 40, 1, 40], 0.2], [[0, "#c5bdff", 1, "#ae8dff"]], 1, [0, 0], null, [-90, -90], [0, 0], 0, 0, 0, [3, 5], 1, 0.1, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -250, 816, 600], 0, 0, "particle9", 6, ""],
		"_auto:0:light_purple_w2/h": [4, [[0, 0, 0.5, 0, 1, 0]], [[0, 0, 0.5, 0, 1, 0], 0.5], [[0, 600, 0.2, 360, 1, 300], 0.3], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, 0, [2, 2.5], 1, 0.5, 0.5, 1, -1, 10000, [5, 0.1], 1, [0, 0], [-408, 0, 816, 500], 0, 0, "particle1", 6, ""],
		"_sub:0:light_purple_w2/h": [4, [[0, 0, 0.25, 1, 0.5, 0, 0.75, 1, 1, 0]], [[0, 0.3, 1, 0], 1], [[0, 5, 1, 5], 1], [[0, "#24fffb", 1, "#ac27ff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 2.5], 1, 0.04, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "particle8", 0, ""],
		"_auto:0:light_purple_w3/h": [4, [[0, 0, 0.5, 0, 1, 0]], [[0, 0, 0.5, 0, 1, 0], 0.5], [[0, 800, 0.2, 500, 1, 400], 0.5], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [-90, -90], [0, 0], 0, 0, 0, [2, 2.5], 1, 0.5, 0.5, 1, -1, 10000, [5, 0.1], 1, [0, 0], [-408, 0, 816, 500], 0, 0, "particle1", 6, ""],
		"_sub:0:light_purple_w3/h": [4, [[0, 0, 0.5, 0.7, 1, 0]], [[0, 0.2, 1, 0.2], 0.5], [[0, 0, 1, 0], 1], [[0, "#69b7ff", 1, "#ac27ff"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1.5], 1, 0.03, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],

		"_auto:0:light_gold_w1/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.45, 1, 0.45], 0.3], [[0, 50, 1, 50], 0.2], [[0, "#fff849", 1, "#fffdbd"]], 1, [20, -15], null, [0, 360], [50, -50], 0, 0, 0, [2, 3], 1, 0.1, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "dust2g,dust4g,dust3g,dust1g", 0, ""],
		"_auto:0:light_gold_w2/h": [4, [[0, 1, 1, 1]], [[0, 0, 1, 0], 0.5], [[0, 500, 1, 500], 1], [[0, "#ffffff", 1, "#ffffff"]], 0, [150, -250], null, [20, 35], [0, 0], 0, 0, 0, [1.5, 1.5], 1, 0.7, 0.7, 1, -1, 1000, [10, 0.03], 1, [0, 0], [-450, -350, 100, 400], 0, 0, "particle1", 6, ""],
		"_sub:0:light_gold_w2/h": [4, [[0, 0.1, 1, 0]], [[0, 0.5, 1, 0.3], 1], [[0, 0, 1, 0], 1], [[0, "#f6ff8d", 1, "#f9ff8d"]], 0, [0, 0], null, [0, 0], [0, 0], 0, 0, 0, [0.4, 0.6], 1, 0.0075, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "line_oval1", 0, ""],
		"_sub:1:light_gold_w2/h": [4, [[0, 0, 0.5, 0.1, 1, 0]], [[0, 1.5, 1, 0], 0.75], [[0, 0, 1, 0], 0], [[0, "#fff4a0", 1, "#ffe737"]], 1, [0, -10], null, [-60, -120], [0, 0], 0, 0, 0, [0.5, 0.5], 1, 0.1, 0.5, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],
		"_auto:0:light_gold_w3/h": [4, [[0, 0.8, 0.8, 0.8, 1, 0]], [[0, 0.2, 1, 0.1], 0.1], [[0, 250, 0.5, 125, 1, 250], 0.3], [[0, "#ffeea8", 1, "#ffeba6"]], 1, [1, -0.5], null, [30, 30], [-240, 240], -1, 0, 0, [4.5, 9], 1, 0.075, 1, 1, -1, 10000, [5, 0.2], 1, [0, 0], [-500, -450, 0, 650], 0, 0, "leaf1g", 6, ""],

		"_auto:0:light_monochrome_w1/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.1, 1, 0.1], 0], [[0, 25, 1, 25], 0.2], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 4], 0, 0.125, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_auto:1:light_monochrome_w1/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0.1, 1, 0.1], 0], [[0, 25, 1, 25], 0.2], [[0, "#000000", 1, "#000000"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [2, 4], 0, 0.125, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_auto:0:light_monochrome_w2/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0, 1, 0], 0.5], [[0, 250, 1, 250], 0.3], [[0, "#ffffff", 1, "#ffffff"]], 1, ["0", 0], null, [0, 360], [0, 0], 0, 0, 0, [0.3, 0.5], 1, 0.3, 0.5, 1, -1, 10000, [20, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_monochrome_w2/h": [4, [[0, 0, 0.2, 0.5, 1, 0]], [[0, 0.2, 0.2, 0.13, 1, 0], 0.1], [[0, 0, 1, 0], 0.2], [[0, "#ffffff", 1, "#ffffff"]], 1, [0, -20], null, [0, 360], [0, 0], 0, 0, 0, [0.3, 1], 0, 0.003, 0.5, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle5", 0, ""],
		"_auto:0:light_monochrome_w2/h": [4, [[0, 0, 0.25, 1, 0.5, 0.5, 0.75, 1, 1, 0]], [[0, 0, 0.25, 0, 1, 0], 0.5], [[0, 250, 1, 250], 0.3], [[0, "#ffffff", 1, "#ffffff"]], 1, ["0", 0], null, [0, 360], [0, 0], 0, 0, 0, [0.3, 0.5], 1, 0.3, 0.5, 1, -1, 10000, [20, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:1:light_monochrome_w2/h": [4, [[0, 0, 0.2, 0.5, 1, 0]], [[0, 0.2, 0.2, 0.13, 1, 0], 0.1], [[0, 0, 1, 0], 0.2], [[0, "#000000", 1, "#000000"]], 1, [0, -20], null, [0, 360], [0, 0], 0, 0, 0, [0.3, 1], 0, 0.003, 0.5, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle5", 0, ""],
		"_auto:0:light_monochrome_w3/h": [4, [[0, 0, 0.25, 1, 0.75, 1, 1, 0]], [[0, 0.3, 1, 0.3], 0.5], [[0, 30, 1, 30], 0.2], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [8, 16], 1, 2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_monochrome_w3/h": [4, [[0, 0, 0.5, 0.2, 1, 0]], [[0, 0, 0.5, 1, 1, 0], 0.5], [[0, 0, 1, 0], 1], [[0, "#ffffff", 1, "#ffffff"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 1, 0.3, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],
		"_auto:1:light_monochrome_w3/h": [4, [[0, 0, 0.25, 1, 0.75, 1, 1, 0]], [[0, 0.3, 1, 0.3], 0.5], [[0, 30, 1, 30], 0.2], [[0, "#000000", 1, "#000000"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [8, 16], 2, 2, 1, 1, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:1:light_monochrome_w3/h": [4, [[0, 0, 0.5, 0.2, 1, 0]], [[0, 0, 0.5, 1, 1, 0], 0.5], [[0, 0, 1, 0], 1], [[0, "#000000", 1, "#000000"]], 0, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 2, 0.3, 1, 1, -1, 10000, [0, 0], 0, [0, 0], null, 0, 0, "flare", 0, ""],

		"_auto:0:light_rainbow_w1/h": [4, [[0, 0, 0.2, 1, 0.8, 1, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 20, 1, 20], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 1, 1, 1, 25, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_auto:0:light_rainbow_w2/h": [4, [[0, 0, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 100, 1, 100], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, ["180", "180"], [0, 0], 0, 0, 0, [1, 1], 1, 2, 1, 10, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_rainbow_w2/h": [4, [[0, 0, 0.2, 1, 0.8, 1, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 0, 1, 0], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [0.2, 0.2], 1, 0.1, 1, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_auto:0:light_rainbow_w2/h": [4, [[0, 0, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 100, 1, 100], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, ["180", "180"], [0, 0], 0, 0, 0, [1, 1], 1, 2, 1, 10, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_rainbow_w2/h": [4, [[0, 0, 0.2, 1, 0.8, 1, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 0, 1, 0], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [0.2, 0.2], 1, 0.1, 1, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_auto:0:light_rainbow_w2/h": [4, [[0, 0, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 100, 1, 100], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, ["180", "180"], [0, 0], 0, 0, 0, [1, 1], 1, 2, 1, 10, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_rainbow_w2/h": [4, [[0, 0, 0.2, 1, 0.8, 1, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 0, 1, 0], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [0.2, 0.2], 1, 0.1, 1, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_auto:0:light_rainbow_w2/h": [4, [[0, 0, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 100, 1, 100], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, ["180", "180"], [0, 0], 0, 0, 0, [1, 1], 1, 2, 1, 10, -1, 10000, [0, 0], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle8", 6, ""],
		"_sub:0:light_rainbow_w2/h": [4, [[0, 0, 0.2, 1, 0.8, 1, 1, 0]], [[0, 0.2, 1, 0.2], 0.2], [[0, 0, 1, 0], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [0.2, 0.2], 1, 0.1, 1, 1, -1, 10000, [10, 0.05], 0, [0, 0], null, 0, 0, "particle9", 0, ""],
		"_auto:0:light_rainbow_w3/h": [4, [[0, 0, 0.2, 0.5, 0.8, 0.5, 1, 0]], [[0, 0.5, 1, 0.5], 0.2], [[0, 30, 1, 30], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 1, 1, 1, 10, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "particle9", 6, ""],
		"_auto:1:light_rainbow_w3/h": [4, [[0, 0, 0.2, 0.2, 0.8, 0.2, 1, 0]], [[0, 1, 1, 1], 1], [[0, 0, 1, 0], 0.2], [[0, "#a6ff9b", 0.2, "#4d65ff", 0.25, "#ffd044", 0.4, "#ff76e4", 0.5, "#76ffda", 0.75, "#a876ff", 1, "#ff76dd"]], 1, [0, 0], null, [0, 360], [0, 0], 0, 0, 0, [1, 1], 1, 1, 1, 5, -1, 10000, [10, 0.05], 1, [0, 0], [-408, -312, 816, 624], 0, 0, "flare", 6, ""],
	};



	$dataTrpParticleGroupsPreset = {
		"commet": { "repeat": -1, "list": ["set starry_sky/h screen def back", "exceed starry_sky/h 1", "set commet/h weather def back", "sub set commet/h _sub:0 0 -1 0.1 1", "sub set commet/h _sub:1 0 -1 0.2 1"], "targetType": 6, "comment": LC("星空と彗星", 83) },
		"firefly": { "repeat": -1, "list": ["set firefly/h target", "sub set firefly/h _sub:0 0 -1 0.3 1"], "targetType": 7, "comment": LC("蛍", 84) },
		"fireworks": { "repeat": -1, "list": ["set fireworks_shot/h this def back", "sub set fireworks_shot/h _sub:0 1 -1 0 0", "sub set fireworks_shot/h _sub:1 0 0.75 0.5 1"], "targetType": 0, "comment": LC("打ち上げ花火", 85) },


		//漂う光
		"light_green_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<緑/森_1>"
		},
		"light_green_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 0.5 0 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<緑/森_2>"
		},
		"light_green_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0.1 0.9 0.2 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<緑/森_3>"
		},

		"light_black_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<黒/闇_1>"
		},
		"light_black_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0.15 0.85 0.1 0 0", "loop _auto:0:light_green_w1/h"], "targetType": 6,
			"comment": "天候:漂う光<黒/闇_2>"
		},
		"light_black_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0.1 0 0", "sub play _auto:0 _sub:1 0 -1 0.15 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<黒/闇_3>"
		},

		"light_ash_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<灰_1>"
		},
		"light_ash_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0.1 0.8 1 0 1"], "targetType": 6,
			"comment": "天候:漂う光<灰_2>"
		},

		"light_ice_w1": {
			"repeat": -1, "list": ["play _auto:0 target def", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<氷_1>"
		},
		"light_ice_w2": {
			"repeat": -1, "list": ["play _auto:0 target def", "sub play _auto:0 _sub:0 0.15 0.85 0 0 0"], "targetType": 6,
			"comment": "天候:漂う光<氷_2>"
		},
		"light_ice_w3": {
			"repeat": -1, "list": ["play _auto:0 target def", "sub play _auto:0 _sub:0 0.1 -1 0 0 0", "sub play _auto:0 _sub:1 0 -1 0.1 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<氷_3>"
		},

		"light_red_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<赤/炎_1>"
		},
		"light_red_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<赤/炎_>"
		},
		"light_red_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0.1 0.6 0.2 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<赤/炎_1>"
		},

		"light_blue_w1": {
			"repeat": -1, "list": ["play _auto:0 target def", "sub play _auto:0 _sub:0 0.25 0.75 1 0 1", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<青/水_1>"
		},
		"light_blue_w2": {
			"repeat": -1, "list": ["play _auto:0 target def", "sub play _auto:0 _sub:0 0.2 0.8 0.1 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<青/水_2>"
		},
		"light_blue_w3": {
			"repeat": -1, "list": ["play _auto:0 target def", "sub play _auto:0 _sub:0 0 -1 0 0 1"], "targetType": 6,
			"comment": "天候:漂う光<青/水_3>"
		},

		"light_white_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<白/光_1>"
		},
		"light_white_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0.1 0 0", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<白/光_2>"
		},
		"light_white_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<白/光_3>"
		},

		"light_purple_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<紫/魔_1>"
		},
		"light_purple_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0.1 0 0", "loop _auto:0 50 50"], "targetType": 6,
			"comment": "天候:漂う光<紫/魔_2>"
		},
		"light_purple_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0 0 0", "loop _auto:0 50 50"], "targetType": 6,
			"comment": "天候:漂う光<紫/魔_3>"
		},

		"light_gold_w1": {
			"repeat": -1, "list": ["play _auto:0 targete", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<金_1>"
		},
		"light_gold_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0 1 1", "sub play _auto:0 _sub:1 0 0.8 0.1 0 0", "loop _auto:0 0 3"], "targetType": 6,
			"comment": "天候:漂う光<金_2>"
		},
		"light_gold_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<金_3>"
		},

		"light_monochrome_w1": {
			"repeat": -1, "list": ["play _auto:0 target", "play _auto:1 target", "loop _auto:0", "loop _auto:1"], "targetType": 6,
			"comment": "天候:漂う光<白黒/陰陽_1>"
		},
		"light_monochrome_w2": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0.05 0 0", "play _auto:1 target _auto:0", "sub play _auto:1 _sub:1 0 -1 0 0 1", "loop _auto:0", "loop _auto:1"], "targetType": 6,
			"comment": "天候:漂う光<白黒/陰陽_2>"
		},
		"light_monochrome_w3": {
			"repeat": -1, "list": ["play _auto:0 target", "sub play _auto:0 _sub:0 0 -1 0 0 1", "play _auto:1 target", "sub play _auto:1 _sub:1 0 -1 0 0 1", "loop _auto:0", "loop _auto:1"], "targetType": 6,
			"comment": "天候:漂う光<白黒/陰陽_3>"
		},

		"light_rainbow_w1": {
			"repeat": -1, "list": ["play _auto:0 target def spriteset", "loop _auto:0"], "targetType": 6,
			"comment": "天候:漂う光<虹_1>"
		},
		"light_rainbow_w2": {
			"repeat": -1, "list": ["play _auto:0 target def spriteset", "sub play _auto:0 _sub:0 0 0.9 0 0 0", "loop _auto:0", "play _auto:1 target _auto:0 spriteset", "update _auto:1 startRotation 180 180", "sub play _auto:1 _sub:0 0 0.9 0 0 0", "loop _auto:1", "wait 60", "play _auto:2 target _auto:0 spriteset", "update _auto:2 startRotation 90 90", "sub play _auto:2 _sub:0 0 0.9 0 0 0", "loop _auto:2", "play _auto:3 target _auto:0 spriteset", "update _auto:3 startRotation -90 -90", "sub play _auto:3 _sub:0 0 0.9 0 0 0", "loop _auto:3", "wait 60"], "targetType": 6,
			"comment": "天候:漂う光<虹_2>"
		},
		"light_rainbow_w3": {
			"repeat": -1, "list": ["play _auto:0 target def spriteset", "play _auto:1 target def spriteset", "loop _auto:0", "loop _auto:1"], "targetType": 6,
			"comment": "天候:漂う光<虹_3>"
		},
	};


})();